Proyecto_DAW1_API/app/controllers/categories_controller.rb

INSERT INTO "categories" ("name", "subcategories", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Hola"], ["subcategories", "{eeeeeeeee, aaaaa, bbbb}"], ["created_at", "2021-12-15 12:19:57.528811"], ["updated_at", "2021-12-15 12:19:57.528811"]]
---
  def create
    @category = Category.new(category_params)

    if @category.save